jeyabalan-1902/SmartTouchX/STM32_DISPLAY_APP/Core/Src/APP/display_spi_app.c

/*
 * display_spi_app.c
 *
 *  Created on: Jul 8, 2025
 *      Author: kjeyabalan
 */


#include "user_app.h"
#include "display_spi_app.h"
#include "onwords_logo.h"
#include "esp32_uart_app.h"

int current_menu = MENU_MAIN;
int current_selection = 0;
int current_device = 0;
int last_selection = -1;
int last_menu = -1;

int downbutton = 0, upbutton = 0, enter = 0;

// 0=OFF, 1=ON
int device_states[4] = {0, 0, 0, 0};
int last_device_states[4] = {-1, -1, -1, -1};
char selected_audio[20] = {0};
bool menu_drawn = false;
bool buttons_drawn = false;

typedef struct {
    int x, y, width, height;
    int button_id;
    char text[25];
} button_position_t;

button_position_t current_buttons[6];
int button_count = 0;

void Display_Handler(void *param)
{
	ButtonEvent_t evt;

	while(1)
	{
		if (xQueueReceive(btnEventQueue, &evt, 0) == pdPASS) {
		    if (evt == BTN_EVENT_UP) {
		        upbutton = 1;
		        downbutton = 0;
		        enter = 0;
		    }
		    else if (evt == BTN_EVENT_DOWN) {
		        upbutton = 0;
		        downbutton = 1;
		        enter = 0;
		    }
		    else if (evt == BTN_EVENT_ENTER) {
		        upbutton = 0;
		        downbutton = 0;
		        enter = 1;
		    }
		}
		Menu_Handler();
	}
}

void updateToDisplayMenu(void)
{
	if(current_menu == MENU_TOTAL_CONTROL)
	{
		last_selection = current_selection;
		displayTotalControlMenu();
	}
	else if(current_menu == MENU_SEPARATE_CONTROL)
	{
		last_selection = current_selection;
		displaySeparateControlMenu();
	}
	else if(current_menu == MENU_DEVICE_CONTROL)
	{
		last_selection = current_selection;
		displayDeviceControlMenu();
	}
	else if(current_menu == MENU_AUDIO_MENU)
	{
		last_selection = current_selection;
		displayAudioMenu();
	}
	else if(current_menu == MENU_AUDIO_ACTION)
	{
		last_selection = current_selection;
		displayAudioActionPage();
	}
}

void displayMainMenu(void)
{
	if (current_menu != last_menu || !menu_drawn)
	{
		ST7735_SetRotation(1);
		fillScreen(BLACK);
		drawTitleBar("HOME MENU");
		menu_drawn = true;
		buttons_drawn = false;
		last_menu = current_menu;
	}

	if (!buttons_drawn || last_selection != current_selection)
	{
		int start_y = TITLE_HEIGHT + 15;
		button_count = 3;

		drawSingleButton(MARGIN_X, start_y, BUTTON_WIDTH, BUTTON_HEIGHT,
						"MASTER CONTROL", (current_selection == 0), 0);
		drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING, BUTTON_WIDTH, BUTTON_HEIGHT,
						"DEVICE LIST", (current_selection == 1), 1);
		drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING * 2, BUTTON_WIDTH, BUTTON_HEIGHT,
								"SPEAKER TEST", (current_selection == 2), 2);

		buttons_drawn = true;
	}

	last_selection = current_selection;
}

void displayAudioMenu(void)
{
    if (current_menu != last_menu || !menu_drawn)
    {
        ST7735_SetRotation(1);
        fillScreen(BLACK);
        drawTitleBar("AUDIOS");
        menu_drawn = true;
        buttons_drawn = false;
        last_menu = current_menu;
    }

    if (!buttons_drawn || last_selection != current_selection)
    {
        int start_y = TITLE_HEIGHT + 20;
        button_count = 4;

        drawSingleButton(MARGIN_X, start_y, BUTTON_WIDTH, BUTTON_HEIGHT, "HELLO", (current_selection == 0), 0);
        drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING, BUTTON_WIDTH, BUTTON_HEIGHT, "WELCOME", (current_selection == 1), 1);
        drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING * 2, BUTTON_WIDTH, BUTTON_HEIGHT, "ONWORDS", (current_selection == 2), 2);
        drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING * 3, BUTTON_WIDTH, BUTTON_HEIGHT, "GO BACK", (current_selection == 3), 3);

        buttons_drawn = true;
    }

    last_selection = current_selection;
}

void displayAudioActionPage(void)
{
    if (current_menu != last_menu || !menu_drawn)
    {
        ST7735_SetRotation(1);
        fillScreen(BLACK);
        drawTitleBar("AUDIO ACTION");
        menu_drawn = true;
        buttons_drawn = false;
        last_menu = current_menu;
    }

    if (!buttons_drawn || last_selection != current_selection)
    {
        int start_y = TITLE_HEIGHT + 25;
        button_count = 3;

        drawSingleButton(MARGIN_X, start_y, BUTTON_WIDTH, BUTTON_HEIGHT, "PLAY", (current_selection == 0), 0);
        drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING, BUTTON_WIDTH, BUTTON_HEIGHT, "GO BACK", (current_selection == 1), 1);
        drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING * 2, BUTTON_WIDTH, BUTTON_HEIGHT, "GO TO HOME", (current_selection == 2), 2);

        buttons_drawn = true;
    }

    last_selection = current_selection;
}


void displayTotalControlMenu(void)
{
	bool states_changed = false;
	syncDisplayDeviceStates();

	for (int i = 0; i < 4; i++)
	{
		if (device_states[i] != last_device_states[i])
		{
			states_changed = true;
			last_device_states[i] = device_states[i];
		}
	}

	if (current_menu != last_menu || !menu_drawn)
	{
		ST7735_SetRotation(1);
		fillScreen(BLACK);
		drawTitleBar("MASTER CONTROL");
		menu_drawn = true;
		buttons_drawn = false;
		last_menu = current_menu;
		states_changed = true;
	}

	if (states_changed)
	{
		int total_on = 0;
		for (int i = 0; i < 4; i++)
		{
			if (device_states[i]) total_on++;
		}
		updateDeviceCount(total_on);
	}

	if (!buttons_drawn)
	{
		int start_y = TITLE_HEIGHT + 25;
		button_count = 3;

		drawSingleButton(MARGIN_X, start_y, BUTTON_WIDTH, BUTTON_HEIGHT,
						"TOTAL ON", (current_selection == 0), 0);
		drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING, BUTTON_WIDTH, BUTTON_HEIGHT,
						"TOTAL OFF", (current_selection == 1), 1);
		drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING*2, BUTTON_WIDTH, BUTTON_HEIGHT,
						"GO BACK", (current_selection == 2), 2);

		buttons_drawn = true;
	}
	else if (last_selection != current_selection)
	{
		updateButtonSelection(last_selection, current_selection);
	}

	last_selection = current_selection;
}

void displaySeparateControlMenu(void)
{
	bool states_changed = false;
	syncDisplayDeviceStates();

	for (int i = 0; i < 4; i++) {
		if (device_states[i] != last_device_states[i]) {
			states_changed = true;
			last_device_states[i] = device_states[i];
		}
	}

	if (current_menu != last_menu || !menu_drawn) {
		ST7735_SetRotation(1);
		fillScreen(BLACK);
		drawTitleBar("DEVICE LIST");
		menu_drawn = true;
		buttons_drawn = false;
		last_menu = current_menu;
		states_changed = true;
	}

