jeyabalan-1902/SmartTouchX/STM32_DISPLAY_APP/Core/Src/APP/display_spi_app.c
	if (!buttons_drawn || states_changed) {
		int start_y = TITLE_HEIGHT + 10;
		button_count = 5;

		for (int i = 0; i < 4; i++)
		{
			char device_text[20];
			snprintf(device_text, sizeof(device_text), "DEVICE %d [%s]",
					i + 1, device_states[i] ? "ON" : "OFF");
			drawSingleButton(MARGIN_X, start_y + i * 20, BUTTON_WIDTH, 16,
						   device_text, (current_selection == i), i);
		}

		drawSingleButton(MARGIN_X, start_y + 4 * 20, BUTTON_WIDTH, 16,
					   "GO BACK", (current_selection == 4), 4);

		buttons_drawn = true;
	} else if (last_selection != current_selection) {
		updateButtonSelection(last_selection, current_selection);
	}

	last_selection = current_selection;
}

void displayDeviceControlMenu(void) {
	bool state_changed = false;
	syncDisplayDeviceStates();

	if (device_states[current_device] != last_device_states[current_device]) {
		state_changed = true;
		last_device_states[current_device] = device_states[current_device];
	}

	if (current_menu != last_menu || !menu_drawn) {
		ST7735_SetRotation(1);
		fillScreen(BLACK);

		char title[30];
		snprintf(title, sizeof(title), "DEVICE %d CONTROL", current_device + 1);
		drawTitleBar(title);

		menu_drawn = true;
		buttons_drawn = false;
		last_menu = current_menu;
		state_changed = true;
	}

	if (state_changed) {
		updateDeviceControlStatus(current_device, device_states[current_device]);
	}

	if (!buttons_drawn) {
		int start_y = TITLE_HEIGHT + 25;
		button_count = 4;

		drawSingleButton(MARGIN_X, start_y, BUTTON_WIDTH, BUTTON_HEIGHT,
						"TURN ON", (current_selection == 0), 0);
		drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING, BUTTON_WIDTH, BUTTON_HEIGHT,
						"TURN OFF", (current_selection == 1), 1);
		drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING*2, BUTTON_WIDTH, BUTTON_HEIGHT,
						"GO BACK", (current_selection == 2), 2);
		drawSingleButton(MARGIN_X, start_y + BUTTON_SPACING*3, BUTTON_WIDTH, BUTTON_HEIGHT,
						"GO TO HOME", (current_selection == 3), 3);

		buttons_drawn = true;
	} else if (last_selection != current_selection) {
		updateButtonSelection(last_selection, current_selection);
	}

	last_selection = current_selection;
}

void handleNavigation(void) {
    int max_options;
    char src_name[] = "DISPLAY";
    switch(current_menu) {
        case MENU_MAIN:
            max_options = MAIN_MENU_OPTIONS;
            break;
        case MENU_TOTAL_CONTROL:
            max_options = TOTAL_CONTROL_OPTIONS;
            break;
        case MENU_SEPARATE_CONTROL:
            max_options = SEPARATE_CONTROL_OPTIONS;
            break;
        case MENU_DEVICE_CONTROL:
            max_options = DEVICE_CONTROL_OPTIONS;
            break;
        case MENU_AUDIO_MENU:
        	max_options = AUDIO_MENU;
        	break;
        case MENU_AUDIO_ACTION:
        	max_options = AUDIO_ACTION_MENU;
        	break;
        default:
            max_options = 2;
            break;
    }

    if (upbutton) {
        HAL_Delay(200);
        int old_selection = current_selection;
        current_selection = (current_selection - 1 + max_options) % max_options;
        upbutton = 0;

        // Quick highlight update instead of full redraw
        switch(current_menu) {
            case MENU_MAIN:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_TOTAL_CONTROL:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_SEPARATE_CONTROL:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_DEVICE_CONTROL:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_AUDIO_MENU:
				updateButtonSelection(old_selection, current_selection);
				last_selection = current_selection;
				break;
            case MENU_AUDIO_ACTION:
				updateButtonSelection(old_selection, current_selection);
				last_selection = current_selection;
				break;
        }
    }

    if (downbutton) {
        HAL_Delay(200);
        int old_selection = current_selection;
        current_selection = (current_selection + 1) % max_options;
        downbutton = 0;

        switch(current_menu) {
            case MENU_MAIN:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_TOTAL_CONTROL:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_SEPARATE_CONTROL:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_DEVICE_CONTROL:
                updateButtonSelection(old_selection, current_selection);
                last_selection = current_selection;
                break;
            case MENU_AUDIO_MENU:
				updateButtonSelection(old_selection, current_selection);
				last_selection = current_selection;
				break;
			case MENU_AUDIO_ACTION:
				updateButtonSelection(old_selection, current_selection);
				last_selection = current_selection;
				break;
        }
    }

    if (enter) {
        HAL_Delay(200);
        enter = 0;

        switch(current_menu) {
            case MENU_MAIN:
                if (current_selection == 0) {
                    current_menu = MENU_TOTAL_CONTROL;
                    current_selection = 0;
                    menu_drawn = false; // Force menu redraw
                    displayTotalControlMenu();
                } else if (current_selection == 1) {
                    current_menu = MENU_SEPARATE_CONTROL;
                    current_selection = 0;
                    menu_drawn = false; // Force menu redraw
                    displaySeparateControlMenu();
                } else if (current_selection == 2) {
                    current_menu = MENU_AUDIO_MENU;
                    current_selection = 0;
                    menu_drawn = false;
                    displayAudioMenu();
                }
                break;

            case MENU_TOTAL_CONTROL:
                if (current_selection == 0) {
                    setAllDevicesState(1, src_name);
                } else if (current_selection == 1) {
                    setAllDevicesState(0, src_name);
                } else if (current_selection == 2) {
                    current_menu = MENU_MAIN;
                    current_selection = 0;
                    menu_drawn = false; // Force menu redraw
                    displayOnwardsLogoOptimized();
                    HAL_Delay(600);
                    displayMainMenu();
                }
                break;

            case MENU_SEPARATE_CONTROL:
                if (current_selection >= 0 && current_selection <= 3) {
                    current_device = current_selection;
                    current_menu = MENU_DEVICE_CONTROL;
                    current_selection = 0;
                    menu_drawn = false; // Force menu redraw
                    displayDeviceControlMenu();
                } else if (current_selection == 4) {
                    current_menu = MENU_MAIN;
                    current_selection = 0;
                    menu_drawn = false; // Force menu redraw
                    displayOnwardsLogoOptimized();
                    HAL_Delay(600);
                    displayMainMenu();
                }
                break;

            case MENU_DEVICE_CONTROL:
                if (current_selection == 0) {
                    setDeviceState(current_device, 1);
                } else if (current_selection == 1) {
                    setDeviceState(current_device, 0);
                } else if (current_selection == 2) {
                    current_menu = MENU_SEPARATE_CONTROL;
                    current_selection = current_device;
                    menu_drawn = false; // Force menu redraw
                    displaySeparateControlMenu();
                }else if (current_selection == 3) {
                    current_menu = MENU_MAIN;
                    current_selection = 0;
                    menu_drawn = false; // Force menu redraw
                    displayOnwardsLogoOptimized();
                    HAL_Delay(600);
                    displayMainMenu();
                }
                break;

            case MENU_AUDIO_MENU:
                if (current_selection == 0) {
                    strcpy(selected_audio, "HELLO\n");
                    current_menu = MENU_AUDIO_ACTION;
                } else if (current_selection == 1) {
                    strcpy(selected_audio, "WELCOME\n");
                    current_menu = MENU_AUDIO_ACTION;
                } else if (current_selection == 2) {
                    strcpy(selected_audio, "ONWORDS\n");
                    current_menu = MENU_AUDIO_ACTION;
                } else if (current_selection == 3) {
                    current_menu = MENU_MAIN;
                    current_selection = 0;
                    menu_drawn = false;
                    displayOnwardsLogoOptimized();
					HAL_Delay(600);
					displayMainMenu();
                }
                current_selection = 0;
                menu_drawn = false;
                break;

            case MENU_AUDIO_ACTION:
                if (current_selection == 0) {
                    HAL_UART_Transmit(&huart3, (uint8_t *)selected_audio, strlen(selected_audio), HAL_MAX_DELAY);
                } else if (current_selection == 1) {
                    // GO BACK
                    current_menu = MENU_AUDIO_MENU;
                    current_selection = 0;
                    menu_drawn = false;
                } else if (current_selection == 2) {
                    // GO TO HOME
                    current_menu = MENU_MAIN;
                    current_selection = 0;
                    menu_drawn = false;
                    displayOnwardsLogoOptimized();
                    HAL_Delay(600);
                    displayMainMenu();
                }
                break;
        }
    }
}


void Menu_Handler(void)
{
    switch(current_menu)
    {
        case MENU_MAIN:
            displayMainMenu();
            break;
        case MENU_TOTAL_CONTROL:
            displayTotalControlMenu();
            break;
        case MENU_SEPARATE_CONTROL:
            displaySeparateControlMenu();
            break;
        case MENU_DEVICE_CONTROL:
            displayDeviceControlMenu();
            break;
        case MENU_AUDIO_MENU:
			displayAudioMenu();
			break;
		case MENU_AUDIO_ACTION:
			displayAudioActionPage();
			break;
    }
    handleNavigation();
}


