jeyabalan-1902/SmartTouchX/STM32_DISPLAY_APP/Core/Src/APP/display_spi_app.c
void setDeviceState(int device, int state) {
    GPIO_TypeDef* gpio_led_port;
    GPIO_TypeDef *gpio_relay_port;
    uint16_t gpio_led_pin, gpio_relay_pin;
    char deviceItem[15];
    char msg[128];
    switch(device) {
        case 0:
            gpio_led_port = TOUCH_LED1_GPIO_Port;
            gpio_relay_port = L_RELAY_1_GPIO_Port;
            gpio_led_pin = TOUCH_LED1_Pin;
            gpio_relay_pin = L_RELAY_1_Pin;
            sprintf(deviceItem, "device1");
            break;
        case 1:
            gpio_led_port = TOUCH_LED2_GPIO_Port;
            gpio_relay_port = L_RELAY_2_GPIO_Port;
            gpio_led_pin = TOUCH_LED2_Pin;
            gpio_relay_pin = L_RELAY_2_Pin;
            sprintf(deviceItem, "device2");
            break;
        case 2:
            gpio_led_port = TOUCH_LED3_GPIO_Port;
            gpio_relay_port = L_RELAY_3_GPIO_Port;
            gpio_led_pin = TOUCH_LED3_Pin;
            gpio_relay_pin = L_RELAY_3_Pin;
            sprintf(deviceItem, "device3");
            break;
        case 3:
            gpio_led_port = TOUCH_LED4_GPIO_Port;
            gpio_relay_port = L_RELAY_4_GPIO_Port;
            gpio_led_pin = TOUCH_LED4_Pin;
            gpio_relay_pin = L_RELAY_4_Pin;
            sprintf(deviceItem, "device4");
            break;
        default:
            return;
    }

    if (xSemaphoreTake(deviceStateMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
		if (state) {
			HAL_GPIO_WritePin(gpio_led_port, gpio_led_pin, GPIO_PIN_SET);
			HAL_GPIO_WritePin(gpio_relay_port, gpio_relay_pin, GPIO_PIN_SET);
			global_device_states[device] = 1;
			device_states[device] = 1;
		} else {
			HAL_GPIO_WritePin(gpio_led_port, gpio_led_pin, GPIO_PIN_RESET);
			HAL_GPIO_WritePin(gpio_relay_port, gpio_relay_pin, GPIO_PIN_RESET);
			global_device_states[device] = 0;
			device_states[device] = 0;
		}

		xSemaphoreGive(deviceStateMutex);

		cJSON *resp = cJSON_CreateObject();
		cJSON_AddNumberToObject(resp, deviceItem, device_states[device]);
		char *respStr = cJSON_PrintUnformatted(resp);
		if (respStr)
		{
			HAL_UART_Transmit(&huart3, (uint8_t *)respStr, strlen(respStr), HAL_MAX_DELAY);
			HAL_UART_Transmit(&huart3, (uint8_t *)"\n", 1, HAL_MAX_DELAY);
			free(respStr);
		}
		cJSON_Delete(resp);

		snprintf(msg, sizeof(msg), "Device %d turned %s\n", device + 1, state ? "ON" : "OFF");
		//HAL_UART_Transmit(&huart3, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);

		safe_printf("DISPLAY: Device %d set to %s\n",  device + 1, state ? "ON" : "OFF");
	}
}

void setAllDevicesState(int state, char *source) {
	const char *devices[] = {"device1", "device2", "device3", "device4"};
	char msg[128];
	cJSON *resp = cJSON_CreateObject();
    if (xSemaphoreTake(deviceStateMutex, pdMS_TO_TICKS(100)) == pdTRUE) {
        for (int i = 0; i < 4; i++) {
        	GPIO_TypeDef* gpio_led_port;
        	GPIO_TypeDef *gpio_relay_port;
			uint16_t gpio_led_pin, gpio_relay_pin;

            switch(i) {
                case 0:
                	gpio_led_port = TOUCH_LED1_GPIO_Port;
					gpio_relay_port = L_RELAY_1_GPIO_Port;
					gpio_led_pin = TOUCH_LED1_Pin;
					gpio_relay_pin = L_RELAY_1_Pin;
                    break;
                case 1:
                	gpio_led_port = TOUCH_LED2_GPIO_Port;
					gpio_relay_port = L_RELAY_2_GPIO_Port;
					gpio_led_pin = TOUCH_LED2_Pin;
					gpio_relay_pin = L_RELAY_2_Pin;
                    break;
                case 2:
                	gpio_led_port = TOUCH_LED3_GPIO_Port;
					gpio_relay_port = L_RELAY_3_GPIO_Port;
					gpio_led_pin = TOUCH_LED3_Pin;
					gpio_relay_pin = L_RELAY_3_Pin;
                    break;
                case 3:
                	gpio_led_port = TOUCH_LED4_GPIO_Port;
					gpio_relay_port = L_RELAY_4_GPIO_Port;
					gpio_led_pin = TOUCH_LED4_Pin;
					gpio_relay_pin = L_RELAY_4_Pin;
                    break;
            }

            if (state) {
            	HAL_GPIO_WritePin(gpio_led_port, gpio_led_pin, GPIO_PIN_SET);
				HAL_GPIO_WritePin(gpio_relay_port, gpio_relay_pin, GPIO_PIN_SET);
                global_device_states[i] = 1;
                device_states[i] = 1;
                cJSON_AddNumberToObject(resp, devices[i], device_states[i]);
            } else {
            	HAL_GPIO_WritePin(gpio_led_port, gpio_led_pin, GPIO_PIN_RESET);
				HAL_GPIO_WritePin(gpio_relay_port, gpio_relay_pin, GPIO_PIN_RESET);
                global_device_states[i] = 0;
                device_states[i] = 0;
                cJSON_AddNumberToObject(resp, devices[i], device_states[i]);
            }
        }

        xSemaphoreGive(deviceStateMutex);

        char *respStr = cJSON_PrintUnformatted(resp);
		if (respStr)
		{
			HAL_UART_Transmit(&huart3, (uint8_t *)respStr, strlen(respStr), HAL_MAX_DELAY);
			HAL_UART_Transmit(&huart3, (uint8_t *)"\n", 1, HAL_MAX_DELAY);
			free(respStr);
		}
		cJSON_Delete(resp);
		snprintf(msg, sizeof(msg),"All devices turned %s\n", state ? "ON" : "OFF");
        HAL_UART_Transmit(&huart3, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
        safe_printf("%s: All devices set to %s\n", source, state ? "ON" : "OFF");
    }
}

void syncDisplayDeviceStates(void) {
    if (xSemaphoreTake(deviceStateMutex, pdMS_TO_TICKS(10)) == pdTRUE) {
        for (int i = 0; i < 4; i++) {
            device_states[i] = global_device_states[i];
        }
        xSemaphoreGive(deviceStateMutex);
    }
}

void initializeMenu(void)
{
    safe_printf("display_init\n\r");
    current_menu = MENU_MAIN;
    current_selection = 0;
    current_device = 0;
    last_selection = -1;
    last_menu = -1;
    menu_drawn = false;
    buttons_drawn = false;

    for (int i = 0; i < 4; i++) {
        device_states[i] = 0;
        last_device_states[i] = -1;

        setDeviceState(i, 0);
    }
    displayMainMenu();
}



void drawSingleButton(int x, int y, int width, int height, char* text, int selected, int button_id)
{
    fillRect(x-1, y-1, width+2, height+2, BLACK);

    if (selected)
    {
        drawRoundRect(x-1, y-1, width+2, height+2, 3, WHITE);
        fillRoundRect(x, y, width, height, 3, GREEN);
        ST7735_WriteString(x+5, y+4, text, Font_7x10, BLACK, GREEN);
    }
    else
    {
        drawRoundRect(x-1, y-1, width+2, height+2, 3, WHITE);
        fillRoundRect(x, y, width, height, 3, GRAY);
        ST7735_WriteString(x+5, y+4, text, Font_7x10, WHITE, GRAY);
    }

    // Store button position AND TEXT for future updates
    if (button_id < 6)
    {
        current_buttons[button_id].x = x;
        current_buttons[button_id].y = y;
        current_buttons[button_id].width = width;
        current_buttons[button_id].height = height;
        current_buttons[button_id].button_id = button_id;
        strncpy(current_buttons[button_id].text, text, 24);
        current_buttons[button_id].text[24] = '\0';
    }
}

void updateButtonSelection(int old_selection, int new_selection)

{
    // Update old button (unselect)
    if (old_selection >= 0 && old_selection < button_count)
    {
        button_position_t *old_btn = &current_buttons[old_selection];

        // Clear and redraw unselected button with text
        fillRect(old_btn->x-1, old_btn->y-1, old_btn->width+2, old_btn->height+2, BLACK);
        drawRoundRect(old_btn->x-1, old_btn->y-1, old_btn->width+2, old_btn->height+2, 3, WHITE);
        fillRoundRect(old_btn->x, old_btn->y, old_btn->width, old_btn->height, 3, GRAY);
        ST7735_WriteString(old_btn->x+5, old_btn->y+4, old_btn->text, Font_7x10, WHITE, GRAY);
    }

    // Update new button (select)
    if (new_selection >= 0 && new_selection < button_count)
    {
        button_position_t *new_btn = &current_buttons[new_selection];

        // Clear and redraw selected button with text
        fillRect(new_btn->x-1, new_btn->y-1, new_btn->width+2, new_btn->height+2, BLACK);
        drawRoundRect(new_btn->x-1, new_btn->y-1, new_btn->width+2, new_btn->height+2, 3, WHITE);
        fillRoundRect(new_btn->x, new_btn->y, new_btn->width, new_btn->height, 3, GREEN);
        ST7735_WriteString(new_btn->x+5, new_btn->y+4, new_btn->text, Font_7x10, BLACK, GREEN);
    }
}

