jeyabalan-1902/SmartTouchX/STM32_DISPLAY_APP/Core/Src/APP/display_spi_app.c
void updateDeviceStatusText(int device_index, bool is_on)
{
    int text_x = MARGIN_X + 5;
    int text_y = TITLE_HEIGHT + 10 + device_index * 20 + 4;
    fillRect(text_x + 70, text_y, 40, 10, GRAY);
    char status[8];
    snprintf(status, sizeof(status), "[%s]", is_on ? "ON" : "OFF");
    ST7735_WriteString(text_x + 70, text_y, status, Font_7x10, WHITE, GRAY);
}

void updateStatusInfo(char* status, uint16_t color)
{
    fillRect(MARGIN_X, TITLE_HEIGHT + 5, BUTTON_WIDTH, 12, BLACK);
    ST7735_WriteString(MARGIN_X + 2, TITLE_HEIGHT + 7, status, Font_7x10, color, BLACK);
}

void updateDeviceCount(int total_on)
{
    char status[35];
    if(total_on > 0)
    {
    	snprintf(status, sizeof(status), "Status: %d/4 devices", total_on);
    	updateStatusInfo(status, GREEN);
    }
    else
    {
    	snprintf(status, sizeof(status), "Status: %d/4 devices", total_on);
		updateStatusInfo(status, RED);
    }
}

void updateDeviceControlStatus(int device, bool is_on)
{
    char status[25];
    snprintf(status, sizeof(status), "Status: %s", is_on ? "ON" : "OFF");
    uint16_t status_color = is_on ? GREEN : RED;
    updateStatusInfo(status, status_color);
}

void drawCleanButton(int x, int y, int width, int height, char* text, int selected)
{
    if (selected)
    {
        drawRoundRect(x-1, y-1, width+2, height+2, 3, WHITE);
        fillRoundRect(x, y, width, height, 3, GREEN);
        ST7735_WriteString(x+5, y+4, text, Font_7x10, BLACK, GREEN);
    }
    else
    {
        drawRoundRect(x-1, y-1, width+2, height+2, 3, WHITE);
        fillRoundRect(x, y, width, height, 3, GRAY);
        ST7735_WriteString(x+5, y+4, text, Font_7x10, WHITE, GRAY);
    }
}

void drawTitleBar(char* title) {
    fillRect(0, 0, DISPLAY_WIDTH, TITLE_HEIGHT, BLUE);
    int title_length = strlen(title);
    int title_width = title_length * 7;
    int center_x = (DISPLAY_WIDTH - title_width) / 2;

    if (center_x < 2) center_x = 2;

    ST7735_WriteString(center_x, 2, title, Font_7x10, WHITE, BLUE);

    drawLine(0, TITLE_HEIGHT, DISPLAY_WIDTH, TITLE_HEIGHT, WHITE);
}


